---
type: AreaFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# AreaFilter

`Autodesk.Revit.DB.AreaFilter` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AreaFilter | — | `public AreaFilter ()` |
| Method | PassesFilter | — | `` |